app/views/flights/_form.html.erb

SELECT `airplanes`.* FROM `airplanes`
---
  <div class="col l4">
    <%= f.select :airplane_id, Airplane.list_of_airplanes, { prompt: "Select Airplane"}, { required: "required", class: "home-input browser-default" } %>

SELECT `airports`.* FROM `airports`
---
  <div class="col l4">
    <%= f.select :origin_id, Airport.list_airports, { prompt: "Select Origin Airport"}, { required: "required", class: "home-input browser-default" } %>