app/views/airplanes/_seat_configuration_fields.html.erb

  <div class="col-sm-6">
    <%= f.collection_select :seat_category_id,
                              SeatCategory.all.order(:id),
                              :id,
                              :name,
                              {},
                              {:class=>'input-field col s12'} %>
---
SELECT `seat_categories`.* FROM `seat_categories` ORDER BY `seat_categories`.`id` ASC