app/controllers/airplanes_controller.rb

  def create
    @airplane = Airplane.new(seat_configuration_params)

    if @airplane.save
---
INSERT INTO `seats` (`seat_configuration_id`, `pnr_number`) VALUES (25, 'rlQU5yCd')
INSERT INTO `airplanes` (`name`, `airplane_type`) VALUES ('MTM', 'Airbus')
INSERT INTO `seat_configurations` (`airplane_id`, `seat_category_id`, `number_of_rows`, `seats_in_row`) VALUES (2, 4, 3, 10)

  def update
    @airplane = Airplane.find(params[:id])
---
SELECT  `airplanes`.* FROM `airplanes` WHERE `airplanes`.`id` = 1 LIMIT 1

  def set_airplane
    @airplane = Airplane.find(params[:id])
---
SELECT  `airplanes`.* FROM `airplanes` WHERE `airplanes`.`id` = 1 LIMIT 1