app/controllers/flights_controller.rb

  def create
    @flight = Flight.new(flight_params)

    if @flight.save
---
INSERT INTO `flights` (`airplane_id`, `flight_number`, `origin_id`, `destination_id`, `created_at`, `updated_at`) VALUES (6, '12345', '1', '2', '2019-01-27 19:51:37', '2019-01-27 19:51:37')

  def update
    if @flight.update_attributes(flight_params)
---
UPDATE `flights` SET `flight_number` = '123456', `updated_at` = '2019-01-27 19:55:22' WHERE `flights`.`id` = 1

  def set_flight
    @flight = Flight.find(params[:id])
---
SELECT  `flights`.* FROM `flights` WHERE `flights`.`id` = 1 LIMIT 1