app/controllers/users_controller.rb

  def create
    @user = User.new(users_params)
    if @user.save
---
INSERT INTO `users` (`name`, `email`, `password_digest`, `created_at`, `updated_at`) VALUES ('Aps', 'sakthilak.sl@gmail.com', '$2a$10$bDtKWKBS8o.kRAp8Bx5HGOGj6KbdetoSzACcpV1Y9SXOKzIX2Q.ua', '2019-01-26 19:17:26', '2019-01-26 19:17:26')