app/models/airplane.rb

  def self.list_of_airplanes
    Airplane.all.map{|airplane| [airplane.name, airplane.id]}
---
SELECT `airplanes`.* FROM `airplanes`