app/models/airport.rb

SELECT `airports`.* FROM `airports`
---
  def self.list_airports
    Airport.all.map{|airport| [airport.name_with_state, airport.id]}