app/models/seat_configuration.rb

  def create_seat
    total_seats = self.number_of_rows * self.seats_in_row
    return if total_seats == 0

    1.upto(total_seats) do |index|
      seat = Seat.new
      seat.pnr_number = generate_code(8)
      seat.seat_configuration_id = self.id
      seat.save
---
INSERT INTO `seats` (`seat_configuration_id`, `pnr_number`) VALUES (25, 'rlQU5yCd')